import newAva from "./img/photoAfter_final.jpg";

const MainInfo = () => {

  return (
    <>
      <div className="ava__track">
      <img className="ava__track_img" src={newAva} alt="newMe"/>
      </div>
      <div className="about_me__track">
        Захарчук Артем Вадимович <br/>
        чоловік, 33 роки, народився 5 травня 1989 року, одружений <br/><br/>
        +380503899090 <span className="grey">(бажаний спосіб зв'язку)</span><br/>
        artemzakharchuk@gmail.com <br/><br/>
        місце проживання: Київ <br/>
        громадянство: Україна <br/><br/>
        Дисципліна, уважність до дрібниць, відчуття процесу, крайня необхідність робити усе правильно і негайно видозмінювати процеси у випадку помилок, відсутність в словниковому запасі виразу "не знаю" - лише частина характеристик, якими мусить володіти спеціаліст з логістики і які можуть бути корисними в новому для мене напрямку.<br/> На початковому етапі вивчення JS, я не сприймав цю мову програмування серйозно. Але в процесі пізнання доволі швидко збагнув, що вона не проста і тут є куди заглиблюватись. <br/> Відчуваю сталий інтерес до поглиблення знань, а тому сподіваюсь в короткі терміни отримати практичний досвід аби посісти не посереднє місце серед колег-програмістів.
      </div>
      <div className="expirience__track">Курси</div>
      <div className="descr__track">Мої роботи</div>
      <div className="achievements__track">Опис курсу</div>
    </>
  )
}

export default MainInfo;